{
  "code": 0,
  "credits": 0.003,
  "result": {
    "next_page_id": "1",
    "data": [
      {
        "attributes": {
          "date": "2022-12-18T00:57:35Z",
          "isEdited": false,
          "rating": 5,
          "review": "New: I am really unhappy with the bugs in the updated version in the app. In certain subreddits that I am active in, I can no longer sort by “New”. The “New” sorting button is completely broken. My settings are set to sort by New, and my communities are set to automatically sort by new, but this feature no longer works. I can see the newest posts in the communities I am in on Safari, but I can no longer see them on the app. Once fixed, I’ll update my rating because I’ve been on Reddit for years and this is my favorite source of Social Media. Hopefully this will be fixed soon because this is a huge issue, and judging from other reviews, I am not the only one having this problem. \n\n Previous Review: I have been using the Reddit app for quite a while now, and I love it. There are so many great features, and the process is very smooth. The application is also very easy to use, and the admins are always very helpful if any issues arise. This is 100% the best app I have ever used. If I could request an addition to anything, I would say more customizable avatars for purchase and to bring back power ups, but this is definitely no downside to having the app. It’s my favorite!",
          "title": "Update: Bugs",
          "userName": "NocturnalPhoenix"
        },
        "id": "9407538438",
        "type": "user-reviews"
      },
      {
        "attributes": {
          "date": "2023-07-12T06:03:22Z",
          "isEdited": false,
          "rating": 2,
          "review": "Every time this app updates, it gets worse. They change useless things like the visuals of the buttons to save images and videos (if and when that works). On that note, for reasons unknown to man or beast, heaven or earth, they removed the ability to save GIFs. It’s not the first time, and I assume sooner or later it’ll be back and they’ll want praise for once again doing the absolute bare minimum. The ability to save videos almost never works either, unless you know the trick to go to comments, go back, press the save button again, and hope to your personal god *that* works. Even if it does work, for some reason the videos always save without sound. All of these used to be features that inexplicably are constantly removed, changed, replaced, and put back. Honestly, I don’t know why this app, of all apps, needs to update this much. Especially when most of the changes are aesthetic and the ones that aren’t always make things worse. I never got a chance to use any of the third-party apps, but I wish that I had. The only reason I’m giving this two stars instead of one is so that people don’t think that this is a fake review and it gets filtered out. This is a real review and real frustration from a real user. But it’s like the people who designed this app don’t actually use it themselves. Just make things work and then leave it alone.",
          "title": "Every time they fix one thing, they break three more.",
          "userName": "TheLastDragon21"
        },
        "id": "10130890747",
        "type": "user-reviews"
      },
      {
        "attributes": {
          "date": "2021-05-04T07:27:09Z",
          "isEdited": false,
          "rating": 2,
          "review": "Overall the app is quite good. Very fluid, easy to navigate to my favorite subreddits quickly; basically does everything I’d expect from a Reddit client. HOWEVER, there is one feature that drives me absolutely batty. The scroll button. You know the one. The one where you accidentally click it and it sends you to the bottom of the thread you’re currently reading. There is already a perfectly good feature for this: pressing and holding on the screen collapses the current top-level comment and all child comments. I have had this app since the day it came out and have never, not once, pressed that button on purpose. Most of the time I just stick it in the top right corner and it stays out of the way, where it still creates a minor visual annoyance, but if that was all that happened I would not be writing this review. No, not only can I not get rid of it, it won’t even stay where I put it. Every so often, the button will jump back to its default location, and will not let me move it above that height on the screen. It’s annoying, it’s USELESS, because as I said there is already a feature that accomplishes the same thing, and I can’t remove it. Absolutely horrible feature.\n\nPlease remove it from the app or at the very least give me an option to remove it. As it stands this app is two stars. Remove this infernal button and it will be five.",
          "title": "Please let me remove the scroll button!",
          "userName": "seal_eggs"
        },
        "id": "7296093645",
        "type": "user-reviews"
      },
      {
        "attributes": {
          "date": "2022-02-13T08:44:56Z",
          "isEdited": false,
          "rating": 1,
          "review": "The issue with Reddit is you can’t actually have an opinion, and by that I mean valid opinions that are harmless such as which chip flavor is better or little things like that. The downvote feature penalizes you for getting downvoted, such as it’ll hide your comments or not let you post on certain subreddits if you don’t have enough. For example on the hello fresh subreddit, there was a question asking if they think the price is worth it and only people who agreed yes had upvotes and they downvoted anyone who said they personally didn’t feel like it was worth it. You make a thread asking a question and to have people voice their different harmless opinions, yet they got downvoted? This just proves you have to think the same mindset as everyone else, which is just not how the real world works. The downvote feature should be replaced with if a comment gets reported a certain amount of time it’s automatically deleted, since there could be racist comments or creepy ones that need to get deleted which is understandable. Yet it’s tiring to get downvoted for simple things. People will literally go as far as checking your whole post history and page just to add on to a downvote and prove their point, which is super … odd to me. I honestly just don’t like posting at this point, because even for simple questions I get downvoted if people find it too boring, which is dumb.",
          "title": "You cannot have an opinion and you have to think the same way everyone else does :/!",
          "userName": ":--,)"
        },
        "id": "8350337834",
        "type": "user-reviews"
      },
      {
        "attributes": {
          "date": "2024-03-23T23:12:44Z",
          "isEdited": false,
          "rating": 4,
          "review": "Now I understand “karma” is a big part of this application/website, but please rethink it. I’m not reddit savvy, but i am social media savvy and up to date with how individuals are. Been online most of my life being a “degen” or dealing with them. Karma or not people will find a way to bypass this, if they truly cared, but i am not ashamed to say I don’t. That being said, i have found myself on reddit more often than not. Signing up with alt accounts very often as i do not care much to keep up with a account. However there has been instances where I tried to get my karma up but it is so slow and not that easy unless something sets you up, which in retrospect, is not reliable. For new users how come wanting to speak on matters or ask questions it becomes hard unless you go under an already existing post and ask there, (which may even get you downvoted resulting in negative karma) I believe it’d be simpler to maybe not automod post that are based on karma points but instead trust in your users and communities to handle spam/negativity in a well obtained manner. That should why i gave it 4 stars. Too many times i tried to make a post and wouldn’t go through on any r/ due to no karma. Thank you.",
          "title": "One main issue",
          "userName": "GDavid$100"
        },
        "id": "11078108495",
        "type": "user-reviews"
      },
      {
        "attributes": {
          "date": "2022-05-27T06:54:55Z",
          "isEdited": false,
          "rating": 1,
          "review": "You can’t even state your own opinion with out getting bashed even if it is valid. People make hate pages about other people and im sure it says that you are not supposed to support any sort of bullying or harassment or send links or @ other people and screenshots. The community is just full of sad and awful people who think they know everything and say they want to make the world a better place but then make snark pages about people just because they view the world differently or have a different opinion. So many people get away with nasty hateful things on this platform to where it is worse than tiktok and twitter combined. Honestly the way the app is advertised makes it seem like a wonderful community and so supportive but in reality everyone on their brings u down. No wonder why so many people are depressed on this platform the whole thing is full of hate and ugliness. I don’t know if the owners or people that run the platform know what really happens on their but they should have alot more control on what is said and posted on their just like other platforms. There are seriously older adults on their along with probably minors that talk horribly about one another. The whole community is just horrible its self literally can’t even scroll down without seeing a post hating on someone; just full of so many sad people that think they are doing something right in the world.",
          "title": "Very sensitive community/should have better guidelines",
          "userName": "best revievws"
        },
        "id": "8712249057",
        "type": "user-reviews"
      },
      {
        "attributes": {
          "date": "2022-03-01T03:53:28Z",
          "isEdited": false,
          "rating": 1,
          "review": "This app is so sensitive. I got heavily downvoted then BANNED PERMANENTLY for saying ‘I think you need to read the post again..’ which the person did.. He asked a question that was ANSWERED IN THE POST and was heavily informed about that exact question. And since I got downvoted hard, and I guess some people reported me, I got banned. I tried to make another account but they banned that one too. I’m scared that they banned my IP address because my mom uses Reddit and I don't want her account to get banned just because mine did..\n\nI looked up this issue and this is a HUGE problem on reddit. You literally can’t have your own opinion on this app, or say anything that will POSSIBLY upset people. And if you do, its downvotes, downvotes, downvotes. Then it will be led by subreddit banning or permanent banning. I can understand if someone was being racist, homophobic or just disrespectful. But I see the simplest comments get downvoted. One time, on r/aww it was a video of a woman with her dog at the gym and the dog was being cute or whatever. Some people were wondering why she was allowed to have a dog at the gym so someone answered saying, “She owns the gym, so thats why the dog is there:)” and it had -30 DOWNVOTES??!! WHY?! People on that app are SO sensitive! And they were right!! I looked it up and she did own the gym! And guess what? I tried to click on their account and it was banned. Probably for literally just that one comment. \n\nDo better Reddit.",
          "title": "Banned for no reason",
          "userName": "Video editor 23"
        },
        "id": "8407574791",
        "type": "user-reviews"
      },
      {
        "attributes": {
          "date": "2021-08-04T14:52:51Z",
          "isEdited": false,
          "rating": 1,
          "review": "The way Reddit works essentially is that anyone can claim a subreddit that isn’t already taken and create their own mod team. This means if you don’t want people to talk about baseball cards and you are the first person to get the subreddit r/baseballcards you can essentially shut down any conversation from ever happening about the subject on the platform. Not only that, if they actually want to let people talk about it they can police and ban them w/o giving any reason meaning subreddits often become home to power hungry mods who ban you for disagreeing with them even if not directly. Reddit has no problem with this because the site is big enough that the people effected don’t make enough noise to cause problems for the rest of the users nor do they have any form of recourse. They can appeal to the mod team of the subreddit but they will more than likely end up talking to the person who banned them. You can appeal directly to the Reddit mod team but like I said, they won’t care because as a mod you can ban anyone for any reason so they will say they aren’t breaking any rules. And don’t fool yourself if you are thinking this kind of degenerate mod behavior is exclusive to political subs and the like, it is every corner of reddit. The mods have too much power so of course it goes to their heads. There needs to be some kind of standard mods are held to, it has completely ruined the website.",
          "title": "Mods have too much power",
          "userName": "TheGlobfather"
        },
        "id": "7654458509",
        "type": "user-reviews"
      },
      {
        "attributes": {
          "date": "2023-06-19T00:52:06Z",
          "isEdited": false,
          "rating": 1,
          "review": "I’ve used this app for years. For the last 2 and half years or so, almost every update tries to ‘refine’ the app to make it better. It adds in recommendations that I don’t want, new tabs I never asked for, breaks the post swipe feature (or just outright removes it), forces the media player into a poor TikTok replica that no one asked for. I miss the way this app worked from about 3 years ago. The search bar at the top didn’t randomly break, the video’s actually played mostly correct. For how much I use the app, I can’t really be justified in giving it a 1 star. Considering that this app is marketed as the official Reddit app, I’d expect them to know their target audience, but competing apps are only growing more popular due to new and increasing issues with this app. I’m probably not leaving Reddit for a long while, but I don’t know how much longer I can commit to this app.\nJune 18, 2023\nUpdated the app a couple weeks ago. I absolutely love how often the app crashes, I cannot scroll for me than 10-15 minutes before it crashes. If I’m on the app for a few minutes, background it, lock my phone and come back an hour or two later, it’ll crash almost immediately. I’m going down to a 1 star review because the app is literally only growing worse. That’s also not even touching the removal of 3rd party apps. I did not think it would get worse, and then it did.",
          "title": "Declining features",
          "userName": "Paul_Brown"
        },
        "id": "10048415257",
        "type": "user-reviews"
      },
      {
        "attributes": {
          "date": "2024-03-27T07:52:04Z",
          "isEdited": false,
          "rating": 1,
          "review": "Within the past day or two there was an update to UI gestures when tapping into a post. Functionality before was that you could tap a post to pull up a full view of the image/video/media. For galleries, you could swipe left and right to either end and stay in the post. There was a button for the comments section. Swipe up went to related posts in the same subreddit/feed. Swipe down went back to the card view of the feed. This works fine. \n\nWith the new change, when swiping left, you don’t hit a stop with galleries anymore. It will move on to the next recommended post. If that post is a gallery as well, you have to swipe through ALL the images in the gallery to get to the next recommended post. There’s no other way to continue seeing recommended posts. There’s also no way to stay confined within a single post/gallery anymore since there is no stop. \n\nSwipe up used to be next recommended post, replaced with comments. There was already a button for comments in at least 2-3 places I could think of for a post. Now, the new gestures make the UX more difficult instead of intuitive. They weren’t all that intuitive to begin with, but this makes it more redundant for comments, and harder for post discoverability. I’d love to see more customize-ability with these settings, or at least a way to revert.",
          "title": "New UI gestures oversight",
          "userName": "Silverdude95"
        },
        "id": "11090309997",
        "type": "user-reviews"
      }
    ]
  },
  "tip": "You can read document or contact provider: https://www.idatariver.com/project/apple-app-store-api-f552"
}